let handler = m => m;

handler.all = async function (m) {
let chat = global.db.data.chats[m.chat];

    // Check if the message is from the specific group
    if (m.isGroup && m.chat === '120363158037744921@g.us') {
if (/^ابدا$/i.test(m.text) ) { //sem prefixo 
 conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*يرجى كتابة رقم لإستمارة الي تبي 🫶🏻*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

╭━〔استمارات العامة〕━⬣

1 : *استقبال الأعضاء*
2 : *ترحيب الأعضاء*
3 : *نشر استقبال*
4 : *تحديث بنك*
5 : *انذار اداري*
6 : *طرد مؤبد*
7 : *تخفيض الرتبة*
8 : *ترقية الرتبة* 
9 : *خبر وافيس*
10 : *مسافر*
11 : *تحويل ين*
12 : *تغيير لقب*
13 : *شراء سلعة*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

╭━〔اسئلة مفاجئ ونقاش〕━⬣

14 : *سؤال سهل*
15 : *سؤال متوسط*
16 : *سؤال صعب*
17 : *نقاش*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

╭━〔مسابقات وفعاليات〕━⬣

18 : *مسابقة عادية*
19 : *عملات المسابقة*
20 : *فعالية الأجراس 🛎️*
21 : *فعالية القلوب ♥️*
22 : *فعالية الدروع 🛡️*
23 : *فعالية اتاك 💉*
24 : *فعالية الحبل 🪢*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

   } 

   if (/^1$/i.test(m.text) ) {  
 conn.reply(m.chat, `*❏━═━═✺【🌊】✺━═━═❏*
*نرحب بك في إستقبال 𝐖𝐀𝐕𝐄𝐒*

*لـقــبـك 〔  〕*  

*من انمي؟ 〔  〕*  

*من طرف؟ 〔  〕*             

*بنت او ولد👫 〔  〕*

*تنـبية ) 📌 ممنوع ولد يأخذ لقب بنت والعكس*

*❏━═━═✺【🌊】✺━═━═❏*
*يرجى إنتظـار المشرف👨‍💻﹏✎*
*❏━═━═✺【🌊】✺━═━═❏*
 *✦╣مـع تـحـيـات╠✦*
‏【‏𝐄𝐀𝐒𝐓𓆩🌊𓆪 𝐖𝐀𝐕𝐄𝐒】`, m) 

   } 

   if (/^2$/i.test(m.text) ) {  
 conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*


*⊹ اللقـب 〔  〕*

*⊹ المنـشـن 〔 ⁩⁩ 〕*

*┃⊹تشرفنا وتنورنا ونتمنى منك قضاء الوقت الممتع…🤍💫*

*⊹يرجى دخول الاعلانات 🤍*
*┃⊹ رابط الاعلانات :-*
*『 https://chat.whatsapp.com/LqcJ9ewDR25H8Vf3GuGDJz 』*

*┃⊹ قوانين الممـلـكـة :-*
*『http://2u.pw/JlRt57』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧ *`, m) 

     } 

   if (/^3$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*رابط الإسـتـقـبـال :*
*『 https://chat.whatsapp.com/K7tSg6Npu1xLBuh3PhyzK8 』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*『 نــقـابـة فخمه🎪』*
*『مـشـرفـين تحت خدمتك✨』*
*『اعضاء متفاعلين 🔥』*
*『مسابقات كل يوم🎰』*
*『بوتات🤖』*
*『بنك ومتجر🏦🏪』*
*『بطولات للمملكه⚡』*
*『فعاليات خاصه🔥』*
*『جوائز مختلفه🥇🎖️🏆』*
*『فروع تلبي طلباتك✅』*
*『كتائب مختلفة لجميع المجالات👾』*
*『مجالس تعمل على خدمتك👨🏻‍💻』*
*『 نقابه اسطوريه يلا ادخل🔥』*
*‏◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*قولوا من طرف【】*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^4$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `╔══ ▓🛡️𝐄𝐀𝐒𝐓🛡️▓══╗
╠✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧╣

تم تحديث البنك👍🏻✅🏦
https://docs.google.com/spreadsheets/d/1E6eZX68sGFb3G8bcxV7L-RWGtls23tzosYGqFkEiDCU/edit

-استفسار
-اعتراض
-حذف انذار

الرجاء التواصل مع مسؤول البنك:

ميكاسا @انا

◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉
✦╣مـع تـحـيـات ادارة╠✦
✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^5$/i.test(m.text) ) {  
 conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*❖┃إعلان إنذار🚫┃❖*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*سبب الإنذار⁉️ 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*اللقب👤 『』*

*المنشن📧『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*خصم➖『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*~⚠️تحذير⚠️~*

~*ثلاث إنذارات طرد*~
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات ادارة╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) 

     } 

   if (/^6$/i.test(m.text) ) {  
 conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*❖┃طرد مؤبد 🚫┃❖*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*سبب الطرد ⁉️『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*اللقب👤 『』*

*الرقم📧『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات ادارة╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) 

     } 

   if (/^7$/i.test(m.text) ) {  
 conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*❖┃✦اعلان خفض رتبه✦┃❖*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦💂🏻‍♀️┃ من : 『』*

*✦👤 ┃ الى : 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦👤 ┃ اللقب : 『』*

*✦📧 ┃المنشن : 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*رسالة✉بالتوفيق في مسيرتك القادمة✦*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات ادارة╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) 

     } 

   if (/^8$/i.test(m.text) ) {  
 conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*❖┃✦اعلان ترقيه✦┃❖*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦👤 ┃ من : 『』*

*✦💂 ┃ الي : 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦👤 ┃ اللقب : 『』*

*✦📧 ┃المنشن : 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*رساله ✉️مبروك ونتمنى له التوفيق✦*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات ادارة╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) 

 } 

   if (/^9$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `‏╔══ ▓🛡️𝐄𝐀𝐒𝐓🛡️▓══╗
╠✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧╣
*◢◣ ◥◤◢◣ ◥◤◢◣*



*◢◣ ◥◤◢◣ ◥◤◢◣*
 *✦╣مـع تـحـيـات ادارة╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

 if (/^10$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪✈️❫ ⊰ ─ ─━━◉*
*〘إِعــلان دخــول مـسـافــر〙*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*اهـلاً وسـهـلاً بِــك💕*

*معلومات عن المـسافـر🛬*

*_الـلــقـــب_『』*

*_الـمـنـشـن_『』*

*_الـنـقـابـة_『』*

*_ مدة الـسـفـر_『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*نتمنى لك قضاء وقت ممتع بنقابتنا المتواضعه🤍✨*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^11$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*❖┃✦اعلان تحويل ين✦┃❖*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*❖┃✦معلومات عن المحول✦┃❖*

*✦👤 ┃ اللقب : 『』*

*✦📧 ┃ المنشن : 『』*

*✦💲 ┃ المبلغ المحول (شامل الضريبة) : 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*❖┃✦معلومات عن المستلم✦┃❖*

*✦👤 ┃ اللقب : 『』*

*✦📧 ┃ المنشن : 『』*

*✦💲 ┃ المبلغ المستلم : 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات ادارة╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^12$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*❖┃✦اعلان تغيير لقب✦┃❖*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*


*✦👤 ┃ من : 『』*

*✦👤🆕 ┃ الى : 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*


*✦👤🆕 ┃ اللقب الجديد: 『』*

*✦📧 ┃المنشن : 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات ادارة╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^13$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*⌝ اعـلان شـراء╎ 🛍 ⌞*
*❮✺┃╼╾╼╾⊱🌊⊰╼╾╼╾┃✺❯*

*🜋↫╎الـسـلعـة 📦⇜『 』*

*🜋↫╎الـسـعر 🪙⇜『 』*

*🜋↫╎الـمُـشـتري 👤⇜『 ⁩』*

*❮✺┃╼╾╼╾⊱🌊⊰╼╾╼╾┃✺❯*
*✠ ~تــ✍︎ــوقــيــع ↯:~*
*〘🌊𝐖𝐀𝐕𝐄𝐒┇وافيس🌊〙*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^فعاليات دccddيلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `
\`\`\`قلوب ♥️ \`\`\`
١٥ ديلارا: *فعالية قلوب* 
١٦ ديلارا: *شرح الفعالية قلوب* 
١٧ ديلارا: *نقاط فعالية قلوب* 
١٨ ديلارا: *نتائج فعالية قلوب*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

\`\`\`اجراس 🛎️\`\`\`
١٩ ديلارا: *فعالية اجراس* 
٢٠ ديلارا: *شرح فعالية اجراس* 
٢١ ديلارا: *نقاط فعالية اجراس*
٢٢ ديلارا: *نتائج فعالية الاجراس* 

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

\`\`\`الدروع 🛡️\`\`\`
٢٣ ديلارا: *فعالية الدروع* 
٢٤ ديلارا: *شرح فعالية الدروع*
٢٥ ديلارا *نقاط فعالية الدروع* 
٢٦ ديلارا: *نتائج فعالية الدروع*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

\`\`\`اتاك 💉\`\`\`
٢٧ ديلارا: *فعالية اتاك* 
٢٨ ديلارا: *شرح فعالية اتاك*
٢٩ ديلارا: *نقاط فعالية اتاك* 
٣٠ ديلارا: *نتائج فعالية اتاك*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

\`\`\`الحبل 🪢\`\`\`
٣١ ديلارا: *فعالية الحبل*
٣٢ ديلارا: *شرح فعالية الحبل* 
٣٣ ديلارا: *نقاط فعالية الحبل* 
٣٤ ديلارا: *نتائج فعالية الحبل*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧* `, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

    if (/^21$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

         *✯『🤹🏻‍♂إعلان فعالية 🤹🏻‍♀』✯*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

┃💡✦ نوع الفعالية • 
*『القلوب ╎ ❤️』*

┃📜✦ شرح الفعالية •
* 『تبدء فعالية المقدم يقوم بإرسال صور كتابة الخ .. كل ما تفوز بنقطه تقدر تختار شخص تخصم له قلب ، اخر واحد متبقي عنده قلوب هو الفائز』*

┃⏱️✦ الوقت •  
*『』*

👤✦ المقدم •  
*『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃📝•﹝ مـلاحـظـات ﹞•📝┃*

*١✦ممنوع ارسال صور أو فديوهات*

*٢✦الكلجات لا تحتسب*

*٣✦هواشات وتخريب يتم طردك*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

       if (/^21$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*⌝ فعالية القلوب╎ ❤️⌞*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

📜 شرح الفعاليه╎📜」

*『 كل شخص بيكون معه 3 ❤️ تبدء فعالية المقدم يقوم بإرسال صور كتابة الخ .. كل ما تفوز بنقطه تقدر تختار شخص تخصم له قلب ، اخر واحد متبقي عنده قلوب هو الفائز 』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*▣╎المقدم 🎙️: 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣تــ✍︎ــوقــيــع╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

if (/^21$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*◉✦نـقـاط مسابقة القلوب✦◉*

*◉✦المقدم :*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*👤⇐  ❪❤️❤️❤️❫*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

if (/^21$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*❤️إعــلان نـتـائـج فـعـالـية القلوب❤️*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦المقدم 🎙️ :〘〙*

*✧︎ الـجـائـزة 💴 : 『40』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦الـفـائــز 👑 :〘〙*

*✧︎ الـجـائـزة 💴 : 『30』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*❖ بـاقــي الـمـشـاركـيـن 👥*
*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*

*الـجـائـزة 💴 :『15』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

    if (/^20$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

         *✯『🤹🏻‍♂إعلان فعالية 🤹🏻‍♀』✯*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

┃💡✦ نوع الفعالية • 
*『الأجراس ╎ 🛎️』*

┃📜✦ شرح الفعالية •
* 『المقدم يبدأ بـ تقديم صور او كتابة واي شي مُنوع و اول مشارك يقوم بـ إرسال ايموجي الجرس (🛎️) يسمح له بالإجابة مدة الإجابة تكون 10 ثانية ماتجاوب على السؤال نشوف المرسل الثاني الجرس وارسال الجرس قبل السؤال يتم إقصائك من الفعالية وهكذا』*

┃❓✦ عدد الاسئله • 
*『 』*

┃⏱️✦ الوقت •  
*『』*

👤✦ المقدم •  
*『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃📝•﹝ مـلاحـظـات ﹞•📝┃*

*١✦ممنوع ارسال صور أو فديوهات*

*٢✦الكلجات لا تحتسب*

*٣✦هواشات وتخريب يتم طردك*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

      if (/^20$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*⌝ فـعـالـيـة الأجراس╎ 🛎️⌞*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

📜 شرح الفعاليه╎📜」

*『 المقدم يبدأ بـ تقديم صور أو كتابة و أول مشارك يقوم ب إرسال ايموجي الجرس (🛎️) يسمح له بالإجابة مدة الإجابة 10 ثانية ماتجاوب يتم اختيار شخص ثاني راسل الجرس إذا قمت بإرسال ايموجي الجرس قبل السؤال يتم طردك من الفعالية وعلى حسب مود مقدم』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*▣╎المقدم 🎙️: 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣تــ✍︎ــوقــيــع╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

      if (/^20$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*◉✦نـقـاط الـمسابقة 🛎️✦◉*

*◉✦المقدم :*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*👤⇐  ❪❫*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

      if (/^20$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `حطو رقم

 *١٤ ديلارا*

 اخر قائمة كلها نتائج واضحه حط نفس اسم الاستمارة عدد الاسئلة الي سويتها في الاجراس 
واكتب فوق بعد اسم النقابة 

*🛎️إعلان نتائج فعالية الاجراس🛎️*

وبس ين كل شي فيها وقم بإضافة الالقاب فقط 👍🏻.`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

    if (/^22$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

         *✯『🤹🏻‍♂إعلان فعالية 🤹🏻‍♀』✯*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

┃💡✦ نوع الفعالية • 
*『فعالية الدروع╎ 🛡️』*

┃📜✦ شرح الفعالية •
* 『نبدا باختيار عشوائي للفرق ،كل فريق مكون من ثنائي. في بداية اللعبة كل فريق يمتلك ثلاث دروع 🛡️ ، المقدم يرسل صورة او سؤال او كتابة و اول من يجاوب يختار فريق اخر يتم محو درع من عندهم ، و يمكن لصاحب النقطة يزيد درع لفريقهم بشرط ان لا يزيدو عن ثلاث دروع (3 دروع اقصى شيء) ، الفريق الذي يبقى اخيرا يفوز 』*

┃⏱️✦ الوقت •  
*『』*

👤✦ المقدم •  
*『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃📝•﹝ مـلاحـظـات ﹞•📝┃*

*١✦ممنوع ارسال صور أو فديوهات*

*٢✦الكلجات لا تحتسب*

*٣✦هواشات وتخريب يتم طردك*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

       if (/^22$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*⌝ فعالية الدروع╎ 🛡️ ⌞*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

📜 شرح الفعاليه╎📜」

*『 نبدا باختيار عشوائي للفرق ،كل فريق مكون من ثنائي. في بداية اللعبة كل فريق يمتلك ثلاث دروع 🛡️ ، المقدم يرسل صورة او سؤال او كتابة و اول من يجاوب يختار فريق اخر يتم محو درع من عندهم ، و يمكن لصاحب النقطة يزيد درع لفريقهم بشرط ان لا يزيدو عن ثلاث دروع (3 دروع اقصى شيء) ، الفريق الذي يبقى اخيرا يفوز 』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*▣╎المقدم 🎙️: 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣تــ✍︎ــوقــيــع╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

       if (/^22$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, ` *◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

    *⌝فـعـالـيـة الـدروع ╎ 🛡️⌞*

*◉✦المقدم :*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃✧ الفريق الاول⇜『🛡️🛡️🛡️』*

※👤
※👤

*┃✧ الفريق الثاني⇜『🛡️🛡️🛡️』*

※👤
※👤

*┃✧ الفريق الثالث⇜『🛡️🛡️🛡️』*

※👤
※👤

*┃✧ الفريق الرابع⇜『🛡️🛡️🛡️』*

※👤
※👤

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

       if (/^22$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*🛡️اعلان نتائج فعالية الدروع🛡️*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦المقدم 🎙️ :〘〙*

*✧︎ الـجـائـزة 💴 : 『50』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦الـفـريـق الـفـائـز 👑 :
*〘〙*
*〘〙*

*✧︎ الـجـائـزة 💴 : 『40』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*❖ بـاقــي الـفـرق  👥*
*◈〘〙*
*◈〘〙*

*◈〘〙*
*◈〘〙*

*◈〘〙*
*◈〘〙*

*◈〘〙*
*◈〘〙*

*الـجـائـزة 💴 :『30』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

    if (/^23$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

         *✯『🤹🏻‍♂إعلان فعالية 🤹🏻‍♀』✯*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

┃💡✦ نوع الفعالية • 
*『فـعـالـيـة اتـــاك╎ 💉』*

┃📜✦ شرح الفعالية •
* 『يبدأ صاحب الفعاليه يسوي الاسئله او الصور واللي يجاوب له حقنه 💉 اللي يجمع خمس حقنات يتحول لعملاق ويقتل شخص من الفعاليه وهكذا』*

┃⏱️✦ الوقت •  
*『』*

👤✦ المقدم •  
*『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃📝•﹝ مـلاحـظـات ﹞•📝┃*

*١✦ممنوع ارسال صور أو فديوهات*

*٢✦الكلجات لا تحتسب*

*٣✦هواشات وتخريب يتم طردك*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 


      }

       if (/^23$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*⌝ فـعـالـيـة اتـــاك╎ 💉⌞*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

📜 شرح الفعاليه╎📜」

*『 يبدأ المقدم يسوي الاسئله او الصور  الخ.. واللي يجاوب له حقنه 💉 اللي يجمع 3 حقنات يتحول لعملاق ويقتل شخص من الفعاليه وهكذا 』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*▣╎المقدم 🎙️: 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣تــ✍︎ــوقــيــع╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 


      }

       if (/^23$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

◞فـعـالـيـة اتـــاك╎ 💉◜

*✬ المقدم* 」

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✬〈اللقب〉〈عدد 💉〉✬*

*『لقب』〔0〕*

*『لقب』〔0〕*

*『لقب』〔0〕*

*『لقب』〔0〕*

*『لقب』〔0〕*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      }

       if (/^23$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*💉 اعلان نتائج فعالية اتاك💉*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦المقدم 🎙️ :〘〙*

*✧︎ الـجـائـزة 💴 : 『55』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦الـفـائــز 👑 :〘〙*

*✧︎ الـجـائـزة 💴 : 『40』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*❖ بـاقــي الـمـشـاركـيـن 👥*

*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*
*◈〘〙*

*الـجـائـزة 💴 :『30』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      }

    if (/^24$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

         *✯『🤹🏻‍♂إعلان فعالية 🤹🏻‍♀』✯*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

┃💡✦ نوع الفعالية • 
*『فعالية الحبل╎ 🪢』*

┃📜✦ شرح الفعالية •
* 『نبدا باختيار جمع الاعضاء ونسوي روليت فريقين فقط، في بداية الفعالية  كل فريقين لازم يشدون الحبل بسرعه ، المقدم يرسل صورة او سؤال او كتابة الخ .. و اول من يجاوب يتم ضغط الحبل عند الفريق ، اول فريق منهم يجاوبون 5 ورا بعض ياخذون الحبل منهم ويفوزون وهكذا』*

┃⏱️✦ الوقت •  
*『』*

👤✦ المقدم •  
*『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃📝•﹝ مـلاحـظـات ﹞•📝┃*

*١✦ممنوع ارسال صور أو فديوهات*

*٢✦الكلجات لا تحتسب*

*٣✦هواشات وتخريب يتم طردك*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      }

       if (/^24$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*⌝ فعالية الحبل╎ 🪢⌞*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

📜 شرح الفعاليه╎📜」

*『 نبدا بتسجيل الاعضاء الي يشاركون ونسوي روليت فريقين فقط، في بداية الفعالية  كل فريقين لازم يشدون الحبل 🪢بسرعه ، المقدم يرسل صورة او سؤال او كتابة الخ .. و اول من يجاوب يتم ضغط الحبل عند الفريق 🤼 ، اول فريق منهم يجاوبون 5 ورا بعض ياخذون الحبل منهم ويفوزون وهكذا 』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*▣╎المقدم 🎙️: 『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣تــ✍︎ــوقــيــع╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      }

       if (/^24$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `  *◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

    *⌝فـعـالـيـة الحبل ╎ 🪢 ⌞*

*◉✦المقدم :*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃✧ الفريق الاول⇜『🪢🪢🪢🪢🪢』*

※👤
※👤
※👤
※👤

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃✧ الفريق الثاني⇜『🪢🪢🪢🪢🪢』*

※👤
※👤
※👤
※👤

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      }

       if (/^24$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, ` *✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*🪢  اعلان نتائج فعالية الحبل 🪢*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*✦المقدم 🎙️ :〘〙*

*✧︎ الـجـائـزة 💴 : 『40』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

✦الـفـريـق الـفـائـز :

*〘〙*
*〘〙*
*〘〙*
*〘〙*

*✧︎ الـجـائـزة 💴 : 『30』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

✦الـفـريـق الـخـاسـر :

*〘〙*
*〘〙*
*〘〙*
*〘〙*

*✧︎ الـجـائـزة 💴 : 『20』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

      }

    if (/^14$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*
*❖إعلان سؤال❖*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*السؤال ⁉️:『‌』*

*المدة ⏳: 『5m‌』*

*الصعوبه 🎲:『سهل‌』*

*المقدم 👤:『‌』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦مع تحيات✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^14$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*
*❖انتهى وقت السؤال❖*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*الجواب:『‌』✍🏻*

*الفائز: 『‌』🎉*

*الجائزة:『‌5』💴*

*المقدم:『‌』👤*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^15$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*
*❖إعلان سؤال❖*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*السؤال ⁉️:『‌』*

*المدة ⏳: 『10m』*

*الصعوبه 🎲:『متوسط』*

*المقدم 👤:『‌』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦مع تحيات✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^15$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*
*❖انتهى وقت السؤال❖*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*الجواب:『‌』✍🏻*

*الفائز: 『‌』🎉*

*الجائزة:『‌10』💴*

*المقدم:『‌』👤*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^16$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*
*❖إعلان سؤال❖*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*السؤال ⁉️:『‌』*

*المدة ⏳: 『15m』*

*الصعوبه 🎲:『صعب』*

*المقدم 👤:『‌』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦مع تحيات✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^16$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*
*❖انتهى وقت السؤال❖*
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*الجواب:『‌』✍🏻*

*الفائز: 『‌』🎉*

*الجائزة:『‌15』💴*

*المقدم:『‌』👤*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^18$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

         *✯『🤹🏻‍♂إعلان مسابقه 🤹🏻‍♀』✯*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃💡✦ نوع المسابقه • 『』*

*┃❓✦ عدد الاسئله • 『』*

*┃⏱️✦ الوقت •  『』*

*👤✦ المقدم •  『』*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃📝•﹝ مـلاحـظـات ﹞•📝┃*

*١✦ممنوع ارسال صور أو فديوهات*

*٢✦الكلجات لا تحتسب*

*٣✦هواشات وتخريب يتم طردك*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^19$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*قيمه عمولة المسابقات*

*مسابقة 20سؤال*
-المقدم 20 ين
-المركز الأول 15 ين
بقية المشاركين 5 ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*مسابقة 30سؤال*
-المقدم 35ين
المركز الاول 20ين
بقية المشاركين 10 ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*مسابقة 40سؤال*
المقدم 45ين
المركز الاول 30ين
المركز الثاني 20 ين
بقية المشاركين 10 ين

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*مسابقة 50سؤال*
المقدم 55 ين
المركز الاول 45 ين
المركز الثاني 35 ين
المركز الثالث 25 ين
بقية المشاركين 15 ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*60 سؤال*
المقدم 60
المركز الاول 50ين
المركز الثاني 40 ين
المركز الثالث 30 ين
بقية المشاركين 20 ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*70 سؤال*
المقدم 70 ين
المركز الاول 60 ين
المركز الثاني 50 ين
المركز الثالث 40 ين
بقية المشاركين 30ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*80 سؤال*
المقدم 80 ين
المركز الاول 70ين
المركز الثاني 60 ين
المركز الثالث 50ين
بقية المشاركين 30ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*90 سؤال*
المقدم 90ين
المركز الاول 80ين
المركز الثاني 70 ين
المركز الثالث 60 ين
بقية المشاركين 30 ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*ال 100 سؤال*
المقدم 100ين
المركز الاول 90ين
المركز الثاني 80ين
المركز الثالث 70ين
بقية المشاركين 40ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*المسابقة 200 سؤال*
المقدم 200ين
المركز الاول 160ين
المركز الثاني 140ين
المركز الثالث 120ين
بقية المشاركين 80ين
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*المسابقة 300 سؤال*
المقدم 300ين
المركز الاول 250ين
المركز الثاني 160ين
المركز الثالث 140ين
بقية المشاركين 100
*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*اقصى عدد اسئله مسابقات هي :300 سؤال* 
*غيرها ممنوعه⛔️*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٤٣ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰20⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰15⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰5⊱💴*

*『』⊰5⊱💴*

*『』⊰5⊱💴*

*『』⊰5⊱💴*

*『』⊰5⊱💴*

*『』⊰5⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٤٤ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰35⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰20⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٤٥ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰45⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰30⊱💴*

*┃🥈✦ المركز الثاني 『』⊰20⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*『』⊰10⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٤٦ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰55⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰45⊱💴*

*┃🥈✦ المركز الثاني 『』⊰35⊱💴*

*┃🥉✦ المركز الثالث 『』⊰25⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰15⊱💴*

*『』⊰15⊱💴*

*『』⊰15⊱💴*

*『』⊰15⊱💴*

*『』⊰15⊱💴*

*『』⊰15⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٤٧ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰60⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰50⊱💴*

*┃🥈✦ المركز الثاني 『』⊰40⊱💴*

*┃🥉✦ المركز الثالث 『』⊰30⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰20⊱💴*

*『』⊰20⊱💴*

*『』⊰20⊱💴*

*『』⊰20⊱💴*

*『』⊰20⊱💴*

*『』⊰20⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٤٨ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰70⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰60⊱💴*

*┃🥈✦ المركز الثاني 『』⊰50⊱💴*

*┃🥉✦ المركز الثالث 『』⊰40⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٤٩ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰80⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰70⊱💴*

*┃🥈✦ المركز الثاني 『』⊰60⊱💴*

*┃🥉✦ المركز الثالث 『』⊰50⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٥٠ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰90⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰80⊱💴*

*┃🥈✦ المركز الثاني 『』⊰70⊱💴*

*┃🥉✦ المركز الثالث 『』⊰60⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*『』⊰30⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٥١ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰100⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰90⊱💴*

*┃🥈✦ المركز الثاني 『』⊰80⊱💴*

*┃🥉✦ المركز الثالث 『』⊰70⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰40⊱💴*

*『』⊰40⊱💴*

*『』⊰40⊱💴*

*『』⊰40⊱💴*

*『』⊰40⊱💴*

*『』⊰40⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٥٢ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰200⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰160⊱💴*

*┃🥈✦ المركز الثاني 『』⊰140⊱💴*

*┃🥉✦ المركز الثالث 『』⊰120⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰80⊱💴*

*『』⊰80⊱💴*

*『』⊰80⊱💴*

*『』⊰80⊱💴*

*『』⊰80⊱💴*

*『』⊰80⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
   if (/^٥٣ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

                   *✦⊰🎰انتهت المسابقه🎰⊱✦*

*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『جوائز المسابقه💴』*

*┃✦👑المقدم 『』⊰300⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*┃🥇✦المركز الاول 『』⊰250⊱💴*

*┃🥈✦ المركز الثاني 『』⊰160⊱💴*

*┃🥉✦ المركز الثالث 『』⊰140⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

*『باقي المشاركين』*

*『』⊰100⊱💴*

*『』⊰100⊱💴*

*『』⊰100⊱💴*

*『』⊰100⊱💴*

*『』⊰100⊱💴*

*『』⊰100⊱💴*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✦╣مـع تـحـيـات╠✦*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }

   if (/^١٤ ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*لاهنت حط نفس الرقم والاسم ديلارا مطابق حتى يجيك الاستمارة نفسها*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

\`\`\`اسئلة عامه\`\`\`
٣٥ ديلارا: *سؤال مفاجئ سهل* 
٣٦ ديلارا: *نتيجة سؤال سهل* 

٣٧ ديلارا: *سؤال مفاجئ متوسط* 
٣٨ ديلارا: *نتيجة سؤال متوسط *

٣٩ ديلارا: *سؤال مفاجئ صعب *
٤٠ ديلارا: *نتيجة سؤال صعب*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

\`\`\`مسابقة عامه \`\`\`

٤١ ديلارا: *مسابقة عادية* 

٤٢ ديلارا: *عملات مسابقات*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*

\`\`\`جوائز مسابقة جاهزة فقط ضيف الالقاب\`\`\`

٤٣ ديلارا: *نتائج 20 اسئلة *
٤٤ ديلارا: *نتائج 30 اسئلة *
٤٥ ديلارا: *نتائج 40 اسئلة *
٤٦ ديلارا: *نتائج 50 اسئلة *
٤٧ ديلارا: *نتائج 60 اسئلة*
٤٨ ديلارا: *نتائج 70 اسئلة*
٤٩ ديلارا: *نتائج 80 اسئلة*
٥٠ ديلارا: *نتائج 90 اسئلة*
٥١ ديلارا: *نتائج 100 اسئلة*
٥٢ ديلارا: *نتائج 200 اسئلة*
٥٣ ديلارا: *نتائج 300 اسئلة*

*◉━━─ ─ ⊱ ❪🌊❫ ⊰ ─ ─━━◉*
*✧┃𝐄𝐀𝐒𝐓﹝🌊﹞𝐖𝐀𝐕𝐄𝐒┃✧*`, m) //wm, null, [['Menu', '#menu']], m) botones :V 

 }
    if (/^ديلارا$/i.test(m.text) ) { //sem prefixo 
conn.reply(m.chat, `*مرحبا انا ديلارا صنع من قبل ريوك ساما حيث معروف بلقب اوتشيها ايتاتشي الاعظم*  

 *والان انا شغلي الذي عهد الي السيد ايتاتشي ان اقوم بإرسال استمارات خاصة بالنقابة وافيس *          

*اذا لم تكن تعرف كيف دعني اعلمك*

*مثال:*     
ابدا ديلارا    

*سأقوم انا بأرسال قائمة يحتوي على جميع استمارات المطلوبة فقط كم بكتابة رقم بالغة العربية مع اسمي ديلارا حيث استمارة الترحيب رقم 2 كيف تحصل عليه *

٢ ديلارا 

*وب هاذا الشكل المبسط راح تحصل على كل ماتريد فقط ايتاتشي علمني ورباني وانا امتلك خبرات وشهادات عالية ودارس في جوامع بريطانيا ولندن وباريس ودول متحدة الامريكية وامتلك شهادات جامعية وشهادات عالمية أيضاً وانا اعهد بكل ولائي ل السيد ايتاتشي حيث ملقب بريوك ول وافيس 👍🏻. *`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
        }
        // Add more conditional statements for additional responses
    }

    return !0;
};

export default handler;
