/* بواسطة https://github.com/DIEGO-OFC/DORRAT-BOT-MD */

const handler = async (m, {conn, text}) => {
  m.reply(`▣──────────────────
│ 
*▣─❧"${pickRandom(global.piropo)}"*
│ 
▣──────────────────
${gt}`);
};
handler.tags = ['frases'];
handler.command = ['حبيبي'];
export default handler;

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())];
}

global.piropo = ['أود أن أكون ورقة لأستطيع لف هذا الحلوى.', 'أنتِ كواي فاي بدون كلمة مرور، الجميع يبحث عنك.', 'من يمكن أن يكون الحافلة لأتجول في منحنيات قلبك.', 'أريد أن أطير بدون أجنحة والخروج من هذا الكون والدخول إلى كونك وأحبك بصمت.', 'أود أن أكون زبدة لأتفتت في رغيفك.', 'إذا كان الجمال جريمة، فأنتِ بالفعل في الجحيم.', 'أود أن أكون قطة لأقضي 7 أرواح بجانبك.', 'سرقة خاطئة، ولكني سأسرق قبلة من فمك.', 'ما أجمل السماء عندما تكون واضحة، ولكن الأجمل هو الحب عندما أكون بجانبك.', 'جميلة، اسيري في الظلام، الشمس تذيب الشوكولاتة.', 'إذا كنتِ تكونين بريدًا إلكترونيًا، ستكونين كلمة المرور الخاصة بي.', 'أود أن تكوني جبلًا لأعطيكي جرِّ.', 'فقدتُ رقم هاتفي، هل يمكنك أن تعطيني رقمك؟', 'هل تعتقدين أن الشمس تشرق الآن أم أنها ابتسامتك التي أهديتها لي اليوم؟', 'ليست الروم أو البيرة، أنتِ من أصبح في رأسي.', 'إذا تحدثنا عن الرياضيات، فأنتِ مجموع كل أماني.', 'تبدوين مثل جوجل، لديكي كل ما أبحث عنه.', 'قهوتي المفضلة هي عينيكِ.', 'أود أن أكون فوتوشوب لأقوم بتعديل جميع جسمك.', 'أود أن تكوني حبوب الإفطار لأتناولك في الصباح.', 'من يمكن أن يكون الجوع لأتناولك ثلاث مرات في اليوم.', 'أينما كنتِ، سأكون هناك.', 'قلبي يحمل اسمكِ.', 'كل ضربات قلبي تحمل اسمكِ.', 'كل كلماتي تنطق باسمكِ.', 'أحبك أكثر مما يمكن أن تتخيلي.', 'إذا كان هذا هو الحب، فلنكن معاً إلى الأبد.', 'قلبي ينبض بسرعة عندما أكون بجانبكِ.', 'معكِ، يتوقف الزمن ونحن فقط هنا.', 'الحب هو اللغة التي يتحدث بها قلوبنا.', 'أنتِ الهدية الأغلى التي قدمتها لي الحياة.', 'أنتِ المصباح الذي يرشد قلبي في الظلام.', 'سحر الحب يكمن في كل لمسة نشترك فيها.', 'الحب الحقيقي لا يجعلكِ تشعرين بالقليل، بل يجعلكِ تشعرين بالكثير.', 'أنا كجوجل، لديكِ كل ما أبحث عنه.', 'قهوتي المفضلة هي عينيكِ.', 'أنا أرغب في أن أكون فوتوشوب لأتمكن من تحرير كل جسدكِ.', 'أود أن أكون حبوب الإفطار لأتمكن من تناولكِ في الصباح.', 'من يمكن أن يكون الجوع لأتمكن من تناولكِ ثلاث مرات في اليوم.'];
