import translate from '@vitalets/google-translate-api';
import fetch from 'node-fetch';
import axios from 'axios';
import cheerio from 'cheerio';

const handler = async (m, { conn, command }) => {
  if (command === 'نصيحة') {
   
    const consejo = consejos[Math.floor(Math.random() * consejos.length)];
   
    const mensaje = `▣──────────────────
│ 
🌟 *نصيحة اليوم* 🌟
│ 
❥ ${consejo}
│ 
▣──────────────────
${gt}`;
    await m.reply(mensaje);
  }

  if (command === 'رومانسية') {
 
    const frase_romantica = frasesromanticas[Math.floor(Math.random() * frasesromanticas.length)];

    const mensaje = `▣──────────────────
 │ 
💖 *عبارة رومانسية* 💖
 │ 
 ❥ ${frase_romantica}
 │ 
 ▣──────────────────
 ${gt}`;
    await m.reply(mensaje);
  }

  if (command == 'historiaromantica') {
    try {
   
      const cerpe = await cerpen(`cinta romantis`);

      const storytime = await translate(cerpe.cerita, { to: 'ar', autoCorrect: true }).catch((_) => null);
      const titletime = await translate(cerpe.title, { to: 'ar', autoCorrect: true }).catch((_) => null);
   
      conn.reply(m.chat, `᭥🫐᭢ العنوان: ${titletime.text}\n᭥🍃᭢ المؤلف: ${cerpe.author}\n────────────────\n${storytime.text}`, m);
    } catch {
    
      const err = await fetch(`https://api.lolhuman.xyz/api/openai?apikey=${lolkeysapi}&text=Elabora%20una%20historia%20romantica%20que%20use%20el%20siguiente%20formato:%20%E1%AD%A5%F0%9F%AB%90%E1%AD%A2%20T%C3%ADtulo:%20%E1%AD%A5%F0%9F%8D%83%E1%AD%A2%20Autor:%20%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%E2%94%80%20hsitoria...%20adalah&user=user-unique-id`);
      const json = await err.json();
      const fraseChat = json.result;

      conn.reply(m.chat, fraseChat, m);
    }
  }
};


handler.tags = ['frases'];
handler.command = handler.help = ['نصيحة', 'رومانسية'];
export default handler;


async function cerpen(category) {
  return new Promise((resolve, reject) => {
    const title = category.toLowerCase().replace(/[()*]/g, '');
    const judul = title.replace(/\s/g, '-');
    const page = Math.floor(Math.random() * 5);
  
    axios.get('http://cerpenmu.com/category/cerpen-' + judul + '/page/' + page)
      .then((get) => {
        const $ = cheerio.load(get.data);
        const link = [];
        $('article.post').each(function (a, b) {
          link.push($(b).find('a').attr('href'));
        });
        const random = link[Math.floor(Math.random() * link.length)];
    
        axios.get(random).then((res) => {
          const $$ = cheerio.load(res.data);
          const hasil = {
            title: $$('#content > article > h1').text(),
            author: $$('#content > article').text().split('Cerpen Karangan: ')[1].split('Kategori: ')[0],
            kategori: $$('#content > article').text().split('Kategori: ')[1].split('\n')[0],
            lolos: $$('#content > article').text().split('Lolos moderasi pada: ')[1].split('\n')[0],
            cerita: $$('#content > article > p').text(),
          };
          resolve(hasil);
        });
      });
  });
}


global.frasesromanticas = [
  'أنت النور الذي يضيء حياتي في الظلام.',
  'معك، كل يوم مغامرة جديدة مليئة بالحب.',
  'عيناك هما انعكاس السماء التي أرغب في الانغماس فيها.',
  'كل نبضة في قلبي تحمل اسمك.',
  'في ذراعيك، وجدت المنزل الذي بحثت عنه دائمًا.',
  'أنت الحلم الذي لا أرغب أبدًا في الاستيقاظ منه.',
  'الحب الحقيقي هو أن نكون معًا في السراء والضراء.',
  'لا توجد مسافات عندما يتحد قلبان.',
  'قبلاتك هي اللحن الذي يسرع نبض قلبي.',
  'الحب هو أن نرى فيك ما لا يمكن لأحد آخر أن يراه.',
  'في كل نبضة، أحملك معي إلى كل مكان.',
  'الحب الذي أشعر به نحوك هو قوتي وإلهامي.',
  'كلماتك الحلوة هي غذائي العاطفي اليومي.',
  'أنت أغلى هدية أعطتها لي الحياة.',
  'الوقت يتوقف عندما أكون بجانبك.',
  'في ابتسامتك، أجد السعادة التي بحثت عنها.',
  'كل يوم أقضيه بجانبك هو قصة حب بدون نهاية.',
  'حبنا هو كأنه حكاية خيالية تتحقق.',
  'عناقك هو ملجأي في هذا العالم المضطرب.',
  'أنت السبب فيما آمنت بالقدر.',
  'أن يحب هو أن يرى فيك كل ما لا يمكن للآخرين أن يروه.',
  'حبك هو اللوحة الفارغة التي أرسم عليها سعادتي.',
  'معك، المستقبل هو طريق مليء بالوعود والأحلام.',
  'أنت المنارة التي ترشد قلبي في الظلام.',
  'سحر الحب يكمن في كل لفة نقوم بها معًا.',
  'في ذراعيك، العالم بأكمله يختفي ونحن نكون فقط أنت وأنا.',
  'الحب هو اللغة التي يتحدث بها قلوبنا.',
  'أنت الجزء الذي نقص منه لروحي.',
  'أن يحب هو أن يجد فيك كل ما لم يكن يعرف أبدًا أنه يحتاجه.',
];


global.consejos = [
  'قبل التغيير كجزء طبيعي من الحياة، وتعلم كيفية التكيف معه.',
  'لا تتوقف أبدًا عن التعلم. المعرفة هي أداة قوية.',
  'اعتني بصحتك الجسدية والعقلية؛ فهي أساسية لحياة مليئة.',
  'استمتع بالأشياء الصغيرة، فهي تمنح الحياة معنى.',
  'تعلم كيفية العفو، سواء على الآخرين أو على نفسك، لتحرير قلبك.',
  'قدِّر الوقت الذي تقضيه مع أحبائك، فهو أغلى هدية يمكن أن تعطيها وتتلقاها.',
  'كن لطيفًا ومتعاطفًا مع الآخرين. كل فعل صغير من اللطف قد يحدث فرقًا في حياتهم.',
  'تعلم كيفية قول "لا" عند الضرورة، وقم بتحديد حدود صحية.',
  'ابحث عن الوقت للقيام بما تشغل به روحك وتجعلك تشعر بالحياة.',
  'لا تقارن نفسك بالآخرين، فكل شخص لديه مساره وإيقاعه الخاص في الحياة.',
  'استمع إلى شريكك بالتفهم والتحدث بصدق، فالتواصل أساس علاقة قوية.',
  'لا تخف من التعبير عن مشاعرك، فالصداقة ضرورية في الحب.',
  'تعلم كيفية التنازل والتوصل إلى تسوية، فالحب يتطلب التضحية والجهد المتبادل.',
  'قدِّر الذات واعتني بنفسك وقدِّر نفسك.',
  'تذكر أن العلاقة الصحية تقوم على الثقة المتبادلة واحترام الآخر.',
  'اختر شريكًا يكمِّلك ويجعلك نسخة أفضل من نفسك.',
  'الحب الحقيقي لا يجعلك تشعر بأنك أقل، بل يجعلك تشعر بأنك أكثر.',
  'الحب هو فعل، وهو اختيار يومي يتطلب العمل والأقوال.',
  'ابحث عن وظيفة تشغل بها شغفك، ولن تشعر بأنك تعمل أبدًا.',
  'كن نشيطًا واتخذ المبادرة في عملك، فهذا سيُقدَّر من قبل رؤسائك.',
  'تعلم من أخطائك وفشلك، فهي فرص للنمو والتحسين.',
  'حافظ على موقف إيجابي وابحث عن حلول للتحديات في العمل.',
  'قم ببناء علاقات جيدة مع زملائك في العمل، فالعمل الجماعي أساس النجاح.',
  'حدد أهدافًا واضحة وواقعية، وعمل بجد لتحقيقها.',
  'لا تخاف من طلب المساعدة أو البحث عن من يرشدك، دائمًا هناك شيء جديد للتعلم.',
  'اعترف بإنجازاتك واحتفل بنجاحاتك، مهما كانت صغيرة.',
  'ابحث عن توازن بين حياتك المهنية والشخصية، حيث كلاهما مهم.',
  'العمل جزء هام من حياتك، ولكنه ليس كل ما يحدد من أنت.',
  'آمن بنفسك وقدرتك على تحقيق ما ترغب فيه.',
  'تخيل أهدافك وأحلامك، وتصوَّر كيف ستشعر عند تحقيقها.',
  'ابحث عن إلهام فيمن تعانون من عقبات مماثلة لتلك التي تواجهها.',
  'قبل أن تبدأ، تذكر لماذا بدأت؛ استعد مع هدفك.',
  'قسِّم أهدافك إلى خطوات صغيرة، فذلك سيجعل الطريق أكثر إمكانية وأقل ضغطًا.',
  'لا تخاف من متابعة أحلامك، فالحياة قصيرة جدًا لتعيش بدون أي ندم.',
  'تثق بأنه بالجهد والإصرار، يمكنك تحقيق كل ما ترغب فيه.',
];
