let handler  = async (m, { conn }) => {
conn.reply(m.chat,`▣──────────────────
│
*▣─❧“${pickRandom(global.bucin)}”*
│
▣──────────────────
${gt}`, m)
}
handler.help = ['reto']
handler.tags = ['fun']
handler.command = /سؤال/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

 global.bucin = [ 
 "تتوقع احد يسأل عنك لو سحبت فترة ؟", 
 "اكثر كذبة مشهوره عندك", 
 "شي مستحيل تاكلها ", 
 "وش الوحش ف الحياة ؟", 
 "عندك استعداد تساعك زوجتك او امك في البيت (كنس - طبخ - غسيل )؟", 
 "اعلي مجموع جبته فحياتك ؟", 
 "اكثر حاجة خايف تخسرها ؟", 
 " لو قدامك تغير حاجه ف الحياة ف وش هي ؟",  
 "عمرك عملت خدمة لشخص وهو اتبري منك ؟",  
 " عمرك سقطت ف المدرسة ؟ وكم مرة ؟", 
 "لو زعلت تبكي ؟ ",   
 " لو حطوك في مستشفي المجانين بالغلط , كيف تثبت لهم انك عاقل",  
 "تتوقع اشباهك ال 40 عايشين حياة حلوه ؟",  
 "اقرب شخص لقلبك ؟",  
 "منشن اثنين تحسهم نفس الشخصية",  
 "كلمة لشخص خانك !؟", 
  "لو حياتك عبارة عن كتاب وش كان يكون اسمه ؟", 
  " لو سجنت تتوقع التهمة وش بيكون ؟",  
 " مؤمن بوجود السحر والحسد؟ وليه ؟",  
 "ممكن تسحب على احد عشان ماضية وحش ؟",  
 "اشياء ماتسويها الا وانت رايق ؟ ", 
  " وش الاحسن العقل ولا القلب ؟", 
  " شخصة اول ما تشوفها تحس انك مقهور ؟", 
  "منشن احد تبي تقوله انت اسطورة وانا بحبك", 
  "اكثر شي ودك تنساه ؟",  
  "شعور تبي يموت ؟", 
  "تقدر تعيش من غير اصدقاء ؟", 
  " التاريخ ال انت مستنيه ( السنة او اليوم ال نفسه يجي بسرعه )",  
 " اسم المنطقة ال انت عايش/ة فيها ؟",  
 "انت شايف نفسك اجتماعي ولا انطوائي ؟ ",  
 "شخصية خيالية ( كرتونية ) اتاثرت بيها ؟", 
  "ماهي الكلمات الي تعبر عن حياتك ؟", 
  " منشن لشخص تحسة مصيبة ", 
  " الشخص الي تفكر فيه قبل ما تنام ؟", 
  "اقرب واحد لك بالعائلة ؟ ",  
  "اكثر شي يخوفك ؟", 
  "اغنية لازقة ف مخك", 
  "اكثر صديق مقرب ليك ؟ ",  
 "احسن شي صار لك اليوم ؟",  
 " ها غمض عينك وقول وش المكان ال تحس نفسك فيه 🙃",  
 "جربت الشهره ولا تتمناها ؟", 
  " ممكن تبيع خويك عشان مصلحتك ؟", 
  " اغرب اكله ودك كنت تجرب تاكلها فجاه ؟", 
  " بتحب/ي القطط ؟", 
  " اكتر صفة تكرها ف خويك ؟",  
  "اسمك بالكامل ؟", 
  
 "اكتر حرف تحبه ؟", 
  
 "اكتر شخص تحسه مات ف المجتع ؟", 
  
 "لو لقيت ورقة بيضا وش هترسم فيه عشان تعبر عن حياتك ؟", 
  
 "اكثر شهر انت تفرح لما يجي ؟", 
  
 "قول حقيقة عنك ؟", 
  
 "الاصدق ف الحب الولد ولا البنت ؟", 
  
 "كلمات ماتقدر تستغني عنها ؟", 
  
 "اكثر شي انت خايف تخسرها ؟", 
  
 "اكثر صفة ما تحبها ف البنت ؟", 
  
 "اكثر مادة بتحبها ف الدراسة ؟", 
  
 "تسامح شخص خانك ( كسر قلبك )", 
  
 "اثكر عادة خايسة تسويها وش هي ؟", 
  
 "تحب ايتاتشي بوت ؟", 
  
 "عبر عن احساسك حاليا بجمله ؟", 
  
 " ليه ماتزوجت للحين ؟", 
  
 "تصنيف الافلام او -الكرتون - الانمي الي تحب تتابعه ؟", 
  
 " أنت مع الخطبة عن حب أم مع الخطبة عن طريق الأهل؟", 
  
 "منشن احد صفاته حلو ", 
  
 "مبداك ف الحياة ؟", 
  
 "بتحب الاطفال ؟", 
  
 "اخر خبر حلو كان متى ووش هو ؟", 
  
 "اقرب شخص لقلبك منشنه", 
  
 "لو حياتك زي لبسك وش بيكون ؟", 
  
 "ـ الفتره ذي حاسس اني محتاج ....؟", 
  
 "يالبكاية بكيت قبل كذا ع شخص مات ف فلم او مسلسل ؟", 
  
 "ممكن تكره ال كنت بتحبه ؟",  
  
 "أاتعرضت للظلم قبل كذا ؟", 
  
 "اكثر مكان بتحس فيه بالراحه والامان ؟", 
  
 "ارسل اخر صوره انت حفظتها يحب  ..", 
  
 "جمله من كتاب او روايه ماتقدر تنساها ؟", 
  
 "بتحس بالراحه وانت تسمع قران ؟", 
  
 "اكثر مكان تحس فيه بالامان ؟", 
  
 "اكثر شي بتخاف منها ؟", 
  
 "لو انت غلطت وعرفت انك الغلطان بتحب تعتذر ولا بتبقي حمار ؟", 
  
 "كيف تقلل الدوله من الفقر ؟", 
  
 "صفات الصديق الحقيقي ف رايك ؟", 
  
 "أتمنى له كسراً لاجبر له عبارة عميقة تتمناها لأحد ؟", 
  
 "مع او ضد : اكثر من يحلون مشاكل الناس هم ا من لديهم مشاكل ؟", 
  
 "اكثر هدية نفسك بها ؟", 
  
 "ترضي ترتبط/ي بحد فقير بس جميل/ة ؟", 
  
 "من غرائب لهجتكم ؟", 
  
 "حد عطاك بلوك قبل كذا وانت بتكتب ؟", 
  
 "اكثر جمله اثرت فحياتك ؟", 
  
 " لو بتعيد تسمية اسمك تخليه مثل ماهو ولا بتغيره ؟", 
  
 "عمرك تمنيت الموت ؟", 
  
 "حبيت احد اونلاين قبل كذا ؟", 
  
 " النفس تميل لـ ... ؟", 
  
 "جربت شعور احد يحبك بس انت ماتقدر تحبه ؟", 
  
 "كلمة تقولها لكل واحد منافق ؟", 
  
 "اكثر شخص تفكر فيه ؟", 
  
 "اكثر شي انت كارها فنفسك ؟", 
  
 "فرحان ولا زعلان ؟", 
  
 "مع ام ضد : لو كان خيرا لبقي ؟", 
  
 "حبيت احد من دفعتك قبل كذا ؟",  

   " نفسك تتزوج ؟", 
  
 "عبر عن نفسك ف ٣ كلمات ", 
  
 " أغرب موقف مضحك صارلك في حياتك؟", 
  
 "قوة الاستيعاب عندك كم من 10", 
  
 "اذكر موقف ماتقدر تنساه طول عمرك؟", 
  
 "اغبى كذبه صدقتها وانت صغير/ة؟", 
  
 "فكرت قبل كذا تنتقم من الي ظلمك ؟", 
  
 "بتنام كم ساعه ف اليوم ؟", 
   
 "مع او ضد : السفر يصلح ما افسده الدهر ؟", 
  
 "احسن ايام الاسبوع عندك 🔖؟", 
  
 "تتزوج الي تحبه او تاخذ مليون دولار", 
  
 "على نياتكُم تُرزقون منشن لحد ينطبق عليه المثل ذا ؟", 
  
 "هل يمكنك أن تذكر لي معلومة لا يعرفها عنك أحد؟", 
  
 "اكثر شيخ بتحبه ؟", 
  
 "بتتعامل كيف مع الشخص المُتطفل ( الفضولي ) ؟", 
  
 "موقف غير حياتك؟", 
  
 "تتوقع احد بيفكر فيك الحين ؟",  
  
 "لو عندك عصايه سحريه وش راح تسوي فيه ؟", 
  
 "تحس بالذنب ع شي معين ؟", 
  
 "تحتاج كم وقت عشان تثق ف شخص", 
  
 "اكثر شي يخليك تضحك من اعماق قلبك ؟", 
  
 "حيوانك المفضل؟", 
  
 "🐦‍⬛ بتحب حد ف النقابة ذا ؟", 
  
 "صفة بتحبها ف الناس ؟", 
  
 "احد بيحبني ؟", 
  
 "شعورك وانت تشوف صورة لك وانت صغير ؟", 
  
 "لو احد طنشك عن قصد وش بتسوي ؟", 
  
 "لو معاك ورقه بيضه وقلم وش بتكتب فيه ؟", 
  
 "عدد الصور فجوالك ؟", 
  
 "ايهما اصدق نظره العين ولا نبره الصوت ؟", 
  
 "لو قلطت اخوياك وجابو شخص تكره وش بتسوي ؟", 
  
 "شي اهم عندك من الناس ؟", 
  
 "الاسود ولا الابيض ؟", 
  
 "تحب الرسوم المتحركه (الانمي -الكرتون)", 
  
  
 "بتحب احد ؟", 
  
 "ممكن تاذي احد عشان انت تكرها ؟", 
  
 "اسم الدلع ال ماتحبه ؟", 
  
 "اخر شاات كان مع مين ؟", 
  
 "شفيعك يوم القيامة ؟", 
  
 "ده مش سؤال بس *صلي علي الحبيب*🥹", 
  
 "عبر عن نفسك بايموجي الحين ؟", 
  
 "بتضيع وقت فراغك بوش ؟",  
  
 "اكثر مشرف مو طايقه-طايقاه ؟", 
  
 "نفسك تطلع من البلد ذا ؟ وين بتروح ؟", 
  
 "هل انت تافه ؟", 
  
 "اكثر اسم دلع بتحبه ؟", 
  
 "لو هتقيم حظك كم راح تعطيه من ١٠ ؟", 
  
 "تختار المال ولا الصحة ولا الرضا ؟", 
  
 "علاقتك مع اهلك ؟", 
  
  
 "شي اهلك كارهينها فيك ؟", 
  
 "احقر الناس من ...", 
  
 "تتمنى تغيرك جنسك ولا لا", 
  
 "كلمة تنرفزك ؟", 
  
 "اكثر شخصية عامة بتحبها ؟", 
  
 "شي تخطف النوم من عينك ؟", 
  
 "وش اخر رسالة جاتك ف الواتس ؟", 
  
 "تقيمك للبوت من عشره ؟", 
  
 "ارسل خلفية جوالك ؟", 
  
 " صفة فيك تتمني تغيرها ؟", 
  
 "اكتب سطر من قصيدة جت فـ بالك ؟", 
  
 "بتخاف من شي معيين ؟", 
  
 "لو كان هناك أمامك اختيارين أحدهما الزواج والإستقرار معي هنا والآخر السفر والعمل بالخارج، هتختاري ايه ؟", 
  
 "وزنك ؟", 
  
 "تحس بشي يميزك عن باقي الناس ؟", 
  
 "افضل مكان رحت له ؟", 
  
 "مدري ارجع قول سؤال", 
  
 "لو كسبت خمسه مليون دولار وش بتسوي فيه ؟", 
  
 "لو تبقى عايش ف اخر لعبه لعبتها وش هي لعبه ؟", 
  
 "اكثر انمي - فيلم حبيته فحياتك ؟", 
  
 "اكثر شي انت تبيها الحين ؟", 
  
 "رساله تبي تقولها لحد وما تعرف ؟", 
  
 " من وقتك تصلي ع الرسول صلي الله عليه وسلم 💫", 
  
 "دقيقه من وقتك تدعو لامواتنا واموات المسلمين بالرحمة 🤲🏻", 
  
 "اكثر لغة نفسك تتعلمها ؟", 

 "لو بتسافر خارج المملكة تاخذ معاك مين ؟", 
   
 ] 